Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/studying_abroad/studying_outside_ireland.html.txt.tmx
Source language: en
Languages: ga

source: If you are interested in studying in a European Union member state, another European country or a country outside Europe this document covers the options available to you
ga: Clúdaíonn an cháipéis seo na roghanna atá ar fáil duit má tá suim agat i staidéar a dhéanamh i mballstát den Aontas Eorpach, i dtír Eorpach eile nó i dtír lasmuigh den Eoraip

source: For information about the UK you can read our document about studying in the UK including Northern Ireland
ga: Tá eolas ar staidéar san RA, Tuaisceart Éireann san áireamh le fáil in áit eile ar an láithreán gréasáin seo

source: People choose to study abroad for a number of reasons
ga: Roghnaíonn daoine staidéar a dhéanamh thar lear ar roinnt cúiseanna

source: Entry requirements may be easier, you may have access to courses that are not available in Ireland or you may simply want the experience of studying outside Ireland
ga: D'fhéadfadh na riachtanais iontrála a bheith níos éasca, d'fhéadfadh go mbeadh rochtain agat ar chúrsaí nach bhfuil ar fáil in Éirinn nó d'fhéadfadh go dteastaíonn uait taithí a fháil ar staidéar lasmuigh d'Éirinn

source: It is important to know the differences between studying in Ireland and studying abroad
ga: Tá sé tábhachtach go mbeadh na difríochtaí idir staidéar in Éirinn agus staidéar thar lear ar eolas agat

source: You should find out about the application procedures, length of courses, fees and living expenses before you make a final decision on whether a course of study abroad is suitable for you
ga: Ba chóir modhanna iarratais, fad na gcúrsaí, táillí agus costais mhaireachtála a thabhairt faoi deara sula ndéanann tú cinneadh faoi chúrsa staidéir thar lear a bheith oiriúnach duitse

source: Finding out about courses and studying abroad
ga: Níos mó a fháil amach faoi chúrsaí agus staidéar thar lear

source: If you are a third-level student in Ireland your university or college may have information about opportunities for studying outside Ireland
ga: Más mac léinn tríú leibhéal in Éirinn tú d'fhéadfadh go mbeadh eolas ag d'ollscoil nó choláiste faoi dheiseanna chun staidéar a dhéanamh lasmuigh d'Éirinn

source: You can also get information by applying directly to a third-level institution for a prospectus
ga: Is féidir leat eolas a fháil chomh maith trí iarraidh go díreach ar institiúid tríú leibhéal réamheolaire a sheoladh chugat

source: If you do not have a specific course or institution in mind, there are a number of sources of information on studying abroad:
ga: Mura bhfuil cúrsa nó institiúid ar leith ar intinn agat, tá roinnt foinsí eolais ar staidéar thar lear:

source: • The European Commission provides information about studying in Europe
ga: • Tá faisnéis faoi na hinstitúidí ard-leibhéil i 32 dtíortha Eorpacha ar an láithreán gréasáin Study in Europe

source: It provides information on admission, fees and other areas of interest while studying in Europe
ga: Tá treoracha anseo maidir le cúrsa a róghnú, iarratas a dhéanamh agus conaí san Eoraip

source: • The European Youth Portal is a source of information for young people about studying in Europe both in the European Union and in non-EU countries
ga: • Is foinse eolais do dhaoine óga é an European Youth Portal faoi staidéar san Eoraip, san Aontas Eorpach agus i dtíortha neamh-AE araon

source: It has information on a wide range of other topics for young people including working, travelling, and volunteering in Europe
ga: Tá eolas ann faoi raon leathan ábhar do dhaoine óga lena n-áirítear oibriú, taisteal, agus oibriú go deonach san Eoraip

source: • UNESCO produces an international guide to studying abroad
ga: • Táirgeann UNESCO treoir idirnáisiúnta ar staidéar thar lear

source: It includes a searchable online database of higher-education study opportunities and the scholarships offered by higher education institutions and international organisations in many countries
ga: Áiríonn sé bunachar sonraí ar féidir a chuardach de dheiseanna staidéir ardoideachais agus de na scoláireachtaí arna dtairiscint ag institiúidí ardoideachais agus eagraíochtaí idirnáisiúnta i mbreis agus tír

source: It also has contact details and information on admission requirements, application deadlines, financial aid, fees, living expenses and other relevant information for all courses
ga: Soláthraíonn sé sonraí teagmhála agus eolas ar riachtanais iontrála, spriocdhátaí iarratais, cúnamh airgeadais, táillí, costais mhaireachtála agus eolas ábhartha eile do na cúrsaí go léir chomh maith

source: • WorldWide Classroom is a source of information on courses, student services and practical country information worldwide
ga: • Is foinse eolais ar chúrsaí, sheirbhísí do mhic léinn agus eolas praiticiúil ar thíortha ar fud an domhain é WorldWide Classroom

source: You can use the international programme finder to search for a course in the country and language of your choice
ga: Is féidir leat leas a bhaint as an aimsitheoir cláir idirnáisiúnta chun cuardach a dhéanamh ar chúrsa i do rogha de thír agus theanga

source: Many Irish third-level institutions offer their students the opportunity to travel through their course of study, often through student exchange programmes
ga: Tairgeann mórán institiúidí tríú leibhéal in Éirinn deis dá mic léinn taisteal trína gcúrsaí staidéir. Baintear é seo amach go minic trí leas a bhaint as cláir mhalairte mac léinn

source: Irish institutions establish initial contact with institutions abroad and maintain an ongoing relationship with them
ga: Bunaíonn institiúidí Éireannacha conradh tosaigh le hinstitiúidí thar lear agus coimeádann siad caidreamh leanúnach leo

source: Students move between the two institutions on study and work placements and are offered services such as student orientation, language training, and accommodation services
ga: Bogann mic léinn idir an dá institiúid ar shocrúcháin staidéir agus oibre agus tairgtear seirbhísí dóibh ar nós ionduchtú do mhic léinn, oiliúint teanga, agus seirbhísí lóistín

source: Contact your college for information about any student exchange programmes they may offer
ga: Téigh i dteagmháil le do choláiste chun eolas a fháil faoi aon chláir mhalairte mac léinn a d'fhéadfadh a bheith acu

source: The previous programmes have now closed and no further applications under those programmes can be accepted
ga: Tá na cláir roimhe dúnta anois agus ní féidir glacadh le haon iarratais bhreise faoi na cláir sin

source: Existing projects funded by those programmes will wind down over the next 1 - 3 years
ga: Tiocfaidh tionscadail reatha a maoiníonn na cláir sin iad chun deiridh sna chéad 1 - 3 bliain atá romhainn

source: Erasmus+ will provide opportunities for participants who include students and education staff, to study, train, get work experience and volunteer abroad
ga: Cuirfidh Erasmus+ deiseanna ar fáil do rannpháirtithe lena n-áirítear mic léinn agus foireann oideachais, chun staidéar a dhéanamh, oiliúint a fháil, taithí oibre a ghnóthú agus oibriú go deonach thar lear

source: In addition to providing grants for individuals, Erasmus+ will support transnational partnerships among education, training and youth institutions and organisations
ga: De bhreis ar dheontais a chur ar fáil do dhaoine aonair, tacóidh Erasmus+ le comhpháirtíochtaí trasnáisiúnta i measc institiúidí agus eagraíochtaí oideachais, oiliúna agus óige

source: It will also support national efforts to modernise education, training and youth systems
ga: Chomh maith leis sin, tacóidh sé le hiarrachtaí náisiúnta córais oideachais, oiliúna agus óige a nuachóiriú

source: For the first time it will provide support to sport initiatives
ga: Den chéad uair riamh, cuirfidh sé tacaíocht ar fáil do thionscnaimh spóirt

source: The International Education Financial Aid (IEFA) website provides a database of financial aid information for students who want to study in a foreign country
ga: Soláthraíonn láithreán gréasáin International Education Financial Aid (IEFA) bunachar sonraí d'eolas ar chúnamh airgeadais do mhic léinn gur mian leo staidéar i dtír eachtrach

source: The site contains a comprehensive list of grants, scholarships, loan programmes and other information that may be helpful to those interested in studying abroad
ga: Cuimsíonn an láithreán gréasáin liosta cuimsitheach de dheontais, scoláireachtaí, chláir iasachta agus eolas eile a d'fhéadfadh a bheith ina chabhair dóibh siúd a bhfuil suim acu i staidéar thar lear

source: Erasmus+ provides students with a mobility grant
ga: Tugann an clár Erasmus+ deontas soghluaisteachta do mhic léinn

source: In Ireland maintenance grants under the Student Grants Scheme are available for undergraduate courses of at least 2 years’ duration in a publicly-funded third-level institution in another EU member state
ga: In Éirinn tá deontais chothabhála faoin Scéim singil um Dheontais do Mhic Léinn le fáil do chúrsaí fochéime atá 2 bhliain ar a laghad i bhfad in institiúid tríú leibhéal a fhaigheann maoiniú poiblí i mballstát AE eile

source: Depending on your income you may be eligible for a maintenance grant provided that you fulfill the conditions as to residence, age, academic attainments and nationality
ga: Ag brath ar d'ioncam d'fhéadfá a bheith incháilithe do dheontas cothabhála chomh fada is a chomhlíonann tú na coinníollacha maidir le cónaí, aois, éachtaí acadúla agus náisiúntacht

source: You can find detailed information on the range of Irish grants and funds for students in further and higher education on the website www.studentfinance.ie
ga: Tá faisnéis mionsonraithe faoi dheontais agus chistí do mhic léinn san ardoideachas agus breisoideachas ar an suíomh gréasáin www.studentfinance.ie

source: Funding for postgraduate study
ga: Maoiniú do staidéar iarchéime

source: There are different sources of funding for postgraduate students
ga: Tá foinsí éagsúla de mhaoiniú do mhic léinn iarchéime

source: Some courses are advertised in the newspapers and include funding
ga: Fógraítear roinnt cúrsaí sna nuachtáin agus bíonn maoiniú san áireamh

source: Sometimes financial support is available from the university that is running the postgraduate course; sometimes you need to apply to an external body
ga: Bíonn tacaíocht airgeadais ar fáil uaireanta ón ollscoil a ritheann an cúrsa iarchéime; uaireanta bíonn ort iarratas a chur chuig comhlacht seachtrach

source: Awards are available for a range of subjects, both for taught courses and research programmes
ga: Tá dámhachtainí le fáil do raon ábhar, do chúrsaí múinte agus chláir thaighde araon

source: They vary as to amount, duration and whether they only cover fees or include maintenance as well
ga: Bíonn siad éagsúil ó thaobh méide, faid agus cibé an gclúdaíonn siad táillí amháin nó an gcuimsíonn siad cothabháil de chomh maith

source: There are strict eligibility rules and deadlines for application
ga: Tá rialacha incháilitheachta diana ann agus spriocdhátaí d'iarratais

source: In addition, there are a large number of postgraduate students competing for limited funding
ga: Chomh maith leis sin, tá roinnt mhaith iarchéimithe in iomaíocht do mhaoiniú teoranta

source: Postgraduate research/study scholarships: A number of scholarships for study abroad are awarded annually by foreign governments to Irish students who are engaged in, or have completed a course of third-level education
ga: Scoláireachtaí staidéir/taighde iarchéime: Deonaíonn rialachais eachtracha roinnt scoláireachtaí chun staidéar thar lear gach bliain do mhic léinn Éireannacha atá i mbun chúrsa oideachais tríú leibhéal, nó a bhfuil sé curtha i gcrích acu

source: Details of scholarships are circulated to universities and other relevant third-level institutions of education. Details of scholarships are also published on the Department of Education and Skills website
ga: Scaiptear sonraí na scoláireachtai seo chuig ollscoileanna agus institiúidí oideachais tríú leibhéal ábhartha eile agus foilsítear ar láithreán gréasáin na Roinne Oideachais agus Scileanna iad

source: If you are interested in applying for these scholarships, you should contact the International Section of the Department of Education and Skills and ask to be placed on a mailing list for the scholarship offers
ga: Má tá suim agat iarratas a chur isteach ar na scoláireachtaí seo, ba chóir duit dul i dteagmháil leis an Rannóg Idirnáisiúnta den Roinn Oideachais agus Scileanna agus iarraidh orthu tú a chur ar liosta poist do na tairiscintí scoláireachta

source: Application forms and relevant details will then be posted to you when the offers are open to receive applications
ga: Seolfar foirmeacha iarratais agus sonraí ábhartha chugat ansin nuair a bheidh na tairiscintí oscailte chun iarratais a fháil

source: Tax relief on tuition fees
ga: Faoiseamh cánach ar tháillí teagaisc

source: If you are not eligible for a maintenance grant you or your parent may claim tax relief on third-level fees as follows:
ga: Mura bhfuil tú incháilithe do dheontas cothabhála d'fhéadfá, nó d'fhéadfadh do thuismitheoir, faoiseamh cánach ar tháillí tríú leibhéal a éileamh mar seo a leanas:

source: Undergraduate courses: Tax relief is available for tuition paid for approved full-time/part-time undergraduate courses in both private and publicly funded third-level colleges in any EU member state
ga: Cúrsaí fochéime Tá faoiseamh cánach le fáil do theagasc íoctha ar chúrsaí formheasta fochéime lánaimseartha/páirtaimseartha i gcoláistí tríú leibhéal arna maoiniú go poiblí agus go príobháideach araon i mballstát ar bith den AE

source: It is also available on full-time/part-time undergraduate courses operated by colleges in any EU member state providing distance education in the State
ga: Tá sé le fáil chomh maith ar chúrsaí fochéime lánaimseartha/páirtaimseartha arna reáchtáil ag coláistí mballstát ar bith den AE a sholáthraíonn cianoideachas sa Stát

source: Postgraduate courses: You can claim tax relief on third-level fees for postgraduate courses in a university or publicly funded college in another EU member state, including colleges that provide distance education in the state
ga: Cúrsaí iarchéime: Is féidir leat faoiseamh cánach a éileamh ar tháillí tríú leibhéal do chúrsaí iarchéime in ollscoil nó i gcoláiste a fhaigheann maoiniú poiblí nó i mballstát AE eile, lena n-áirítear coláistí a sholáthraíonn cianoideachas sa stát

source: Tax relief is also available for postgraduate courses in a university or publicly funded third-level college in non-EU countries
ga: Tá faoiseamh cánach le fáil do chúrsaí iarchéime in ollscoil nó i gcoláiste tríú leibhéal a fhaigheann maoiniú poiblí i dtíortha lasmuigh den AE chomh maith

source: Application forms for student grants are available from Student Universal Support Ireland (SUSI)
ga: Tá foirmeacha iarratais ar dheontais do mhic léinn ar fáil ó Thacaíocht Uilíoch do Mhic Léinn, Éire (SUSI)

source: You can get an application form for tax relief on tuition fees from your local tax office
ga: Is féidir leat foirm iarratais ar fhaoiseamh cánach ar tháillí teagaisc a fháil ó d'oifig chánach áitiúil
